# Pandas

In [ ]:
# Pandas - is used for data manipulation and analysis
#1.Pandas is a open source library.
# 2.Pandas is designed over the numpy.
# 3.Data structures in pandas such as serios an datafram convert tonnumpy 1D and 2D arrays.

# Important list of operation in pandas

In [ ]:
# 1. Data Structures (series, Dataframe)
# 2. Data input and output (Excel, CSV, SQL, JSON)
# 3. Understanding the dataset (head(), tail(),dtype(),..)
# 4. Data Filtering and Indexing (Loc,iloc, where(),..)
# 5. Handling missing values(NaN,Null)
# 6. Removing the duplicate values
# 7. Handle inconsistant data (Male,M,Ma)
# 8. Data Transformation (apply(),.)
# 9. Aggregation and grouping functions.
# 10. Time serires Related functions.
# 11. Data Visualization.

# 1. Data Structures (series, Dataframe)

In [4]:
pip install pandas

Requirement already satisfied: pandas in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (2.3.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [6]:
pd.__version__

'2.3.2'

#### Series data structure

In [ ]:
# Series is a 1D array.
# In Ml we store the "Target" in the dataset as a series

In [14]:
# empty series 
ser=pd.Series()
print(ser)

Series([], dtype: object)

In [9]:
# Series from the pyhton List
list1=[1,2,3,4,5,6]
ser1=pd.Series(list1)
print(ser1)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [13]:
#create series from the numpy array
import numpy as np
data= np.array(["Meghana","Pikki","nikki"])
type(data)
ser2=pd.Series(data)
print(ser2)
type(ser2)

0    Meghana
1      Pikki
2      nikki
dtype: object

In [15]:
print(ser2[0])

Meghana

In [17]:
#print(ser2[-3])
# pandas series dont support the negative indexing

In [18]:
data= np.array(["Meghana","Pikki","nikki","chikki"])
ser2=pd.Series(data, index=['a','b','c','d'])
ser2

a    Meghana
b      Pikki
c      nikki
d     chikki
dtype: object

In [19]:
print(ser2['a'])

Meghana

In [20]:
# convert the dictionary into pandas series
data1={"Meghana":21,"Pikki":20,"nikki":35,"chikki":45}
ser3= pd.Series(data1)
ser3

Meghana    21
Pikki      20
nikki      35
chikki     45
dtype: int64

In [22]:
# convert the tuple into pandas series
data3=(5,6,7,8,9)
ser4=pd.Series(data3)
ser4

0    5
1    6
2    7
3    8
4    9
dtype: int64

In [25]:
# convert the set into pandas series
data4={"Meghana","Pikki","nikki","chikki"}
ser5=pd.Series(list(data4))
ser5
# Here set is an unordered datatype, so it won't convert directly into series

0     chikki
1      Pikki
2      nikki
3    Meghana
dtype: object

In [27]:
# convert the scaler to pandas series
val=100
ser6=pd.Series(val)
ser6
ser6=pd.Series(val, index = ['a','b','c'])
ser6

# we convert the scaler(means single value) to the pandas series

a    100
b    100
c    100
dtype: int64

# Data Frame

In [31]:
# DataFrame is a 2D data structure
# we will use DataFrame to Store Datasets

In [34]:
#empty dataframe
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [35]:
# convert the list to dataframe
data=["apple","banana","mango"]
df1=pd.DataFrame(data)
df1

        0
0   apple
1  banana
2   mango

In [37]:
# convert the 2D list to dataframe
data1=[["apple",250],["banana",80],["mango",300]]
df=pd.DataFrame(data1,columns=["Fruit Name","price"])
print(df)

  Fruit Name  price
0      apple    250
1     banana     80
2      mango    300

In [38]:
# convert the 2D tuple to dataframe
data1=(("apple",250),("banana",80),("mango",300))
df=pd.DataFrame(data1,columns=["Fruit Name","price"])
print(df)

  Fruit Name  price
0      apple    250
1     banana     80
2      mango    300

In [ ]:
# convert the 2D set to dataframe
data1={{"apple",250},{"banana",80},{"mango",300}} 
df=pd.DataFrame(data1,columns=["Fruit Name","price"])
print(df)

In [5]:
# create a data frame from the dictionary
data1={ 
    "name":["pappu","briyani","curd","desert"],
    "count":[1,5,100,10]
}
df=pd.DataFrame(data1)
df

      name  count
0    pappu      1
1  briyani      5
2     curd    100
3   desert     10

In [9]:
data1={"Meghana":21,"Pikki":20,"nikki":35,"chikki":45}
data2={
    "Name":["Meghana","Pikki","nikki","chikki"],
    "Age":[21,20,35,45]
}
df2=pd.DataFrame(data2)
df2

      Name  Age
0  Meghana   21
1    Pikki   20
2    nikki   35
3   chikki   45

In [13]:
#convert the series into dataframe
sre=pd.Series([1,2,3,4,5],name="count")
df=sre.to_frame()
df
type(df)

pandas.core.frame.DataFrame